#+title: Supervision
#+author: Asilata Bapat
#+startup: noptag content

* {{{title}}}
#+begin_src emacs-lisp :results silent :exports results
  (defun pp-student ()
    "Pretty-print the current student item. This function is called when mapping over entries in the data.org file."
    (let ((name (org-entry-get nil "ITEM"))
          (year (org-entry-get nil "year-finishing"))
          (comment (org-entry-get nil "comment"))
          )
      (format "- %s (%s)%s"
              name
              year
              (if (or (not comment) (string-equal comment ""))
                  ""
                (concat ". /" comment "/")))
      ))
#+end_src

** Honours
#+begin_src emacs-lisp :results value raw :exports results
  (string-join
   (org-map-entries
    'pp-student
    "supervision+LEVEL=2+type=\"honours\""
    '("data.org"))
   "\n")
#+end_src

#+RESULTS:
- *Yangda Bei (2025):* Jointly supervised with Leonardo Maltoni
- *Tom Gell (2024)*
- *Kieran Lelis (2024)*
- *Isabel Longbottom (2022)*
- *Martin Skilleter (2022):* Jointly supervised with Uri Onn
- *Louis Becker (2021):* University Medal 2021


